{
  "source": "https://www.thecrazytourist.com/25-best-things-to-do-in-bucharest-romania/",
  "title": "Best things to do in Bucharest",
  "attractions": [
    {
      "id": 0,
      "name": "Arch of Triumph",
      "banner": "banner_arch_of_triumph",
      "image": "image_arch_of_triumph",
      "details": "Near the Japanese Gardens beside Herăstrău Park, this monument dates to 1936 to commemorate both the Romanian War of Independence and the First World War.\n\nThe arch is at the same location as an earlier wooden version built in haste to celebrate victory in the War of Independence when the nation broke from the Ottoman Empire in 1878. This was replaced by another wooden arch after the First World War, while the current monument has reliefs carved by Constantin Baraschi, the foremost Romanian sculptor of the 1930s.\n\nThere’s a platform on the roof that you can reach on special days, but the rest of the time it’s a sight to admire from the other side of a very busy roundabout.",
      "coordinates": {
        "lat": 44.4671774,
        "lng": 26.0693827,
        "marker": "Arch of Triumph"
      }
    },
    {
      "id": 1,
      "name": "Botanical Gardens",
      "banner": "banner_botanical_gardens",
      "image": "image_botanical_gardens",
      "details": "With 5,000 plant species in 17 hectares, the Botanical Gardens are maintained by the University of Bucharest.\n\nYou can enter for a small fee, and pay a little extra to go inside the greenhouses like the Sera Veche, which reopened 2011 after being closed for 35 years.\n\nThis structure was built at the start of the 1890s and inside is a small world of tropical and sub-tropical vegetation.\n\nIn the open air are ponds and winding paths guiding you to a rose garden and a glorious display of some 1,000 exotic flowers in summer.",
      "coordinates": {
        "lat": 4.4370336,
        "lng": 26.0597799,
        "marker": "Botanical Garden"
      }
    },
    {
      "id": 2,
      "name": "Cismigiu Gardens",
      "banner": "banner_cismigiu_gardens",
      "image": "image_cismigiu_gardens",
      "details": "25 Best Things to Do in Bucharest (Romania)\nA city of culture in a constant state of flux, Bucharest has been shaped by earthquakes, war and the whims of a dictator. And now in the middle of a construction boom there’s a new wave of snazzy glass facades and high-rise towers that multiply by the year.\n\nBut you can still find big patches of the early 20th-century city dubbed “Little Paris” for its Beaux-Arts-style palaces, municipal buildings and museums. Bucharest harbours surprises like sweet fresco-coated churches hiding in the shadow of communist apartment blocks. Some of these churches were lost in the 1980s when the city was reconfigured along the lines of a European Pyongyang, but many were saved by being moved in one piece to backstreets.\n\nLet’s explore the best things to do in Bucharest:\n\n1. Dimitrie Gusti National Village Museum\nDimitrie Gusti National Village Museum\nSource: Radu Bercan / shutterstock\n\nDimitrie Gusti National Village Museum\n\nThe whole west side of the Herăstrău Park is given over to a massive outdoor museum, which has more than 270 authentic historic buildings.\n\nMade from stone, wood or cob (clay and straw), these have been carefully dismantled and put back together at this site and come from all corners of the country, from Banat in the West to Moldova in the east and Transylvania in the centre.\n\nEach region has its own style, whether it’s the brightly painted walls from the Danube Delta to the ornately carved portals from Berbeşti in the centre of Romania.\n\nThe museum was established by the eminent sociologist Dimitrie Gusti in 1936 and its oldest houses date from the 18th century.\n\nEach house also has a recorded explanation of its style and region, available in English.\n\nSuggested tour: Traditions in Bucharest: Village Museum & Wine Tasting\n\n2. Parliamentary Palace\nParliament Palace, Bucharest\nSource: dragomirescu / shutterstock\n\nParliament Palace\n\nA building of absurd magnitude, the Parliamentary Palace hosts Romania’s Parliament, but also perfectly encapsulates Nicolae Ceaușescu’s megalomania.\n\nAt 365,000 square metres, it’s the largest administrative building in the world, intended as a residence, and despite containing reception halls, museums and government offices and the parliament hall, is still almost three quarters empty.\n\nThe palace was raised at an enormous cost, in terms of money but also lives, as thousands of people are claimed to have died during its construction in the second half of the 1980s.\n\nThe palace was the focal point of Ceaușescu’s pompous redesign of Bucharest following an earthquake in 1977, and had eight subterranean levels, at the bottom of which was a nuclear bunker.\n\nYou have to go in to gauge the full, stupefying size of this building, paying a visit to the Museum of the Palace, Museum of Communist Totalitarianism and the National Museum of Contemporary Art.\n\n\n3. Romanian Athenaeum\nRomanian Athenaeum, Bucharest\nSource: Istomina Olena / shutterstock\n\nRomanian Athenaeum\n\nA performance venue extraordinaire, the Neoclassical Romanian Athenaeum is the home of the George Enescu Philharmonic Orchestra.\n\nWrapped in gardens, this magnificent structure was completed in 1888 and given a thorough restoration to save it from collapse in 1992. Under a grand dome embellished with gilded stuccowork, the circular concert hall seats more than 650 and has an epic fresco on its frieze that depicts the most pivotal events in Romanian history.\n\nFor an affordable night of Haydn, Bach or Mozart, book online and pick up tickets from the box office.\n\nBe here in September for the George Enescu Festival, when there’s a busy programme of performances and one of Eastern Europe’s biggest classical events.\n\n4. Lipscani (Old Town)\nLipscani, Bucharest\nSource: Marco Taliani de Marchio / shutterstock\n\nLipscani\n\nA hint of what Bucharest looked like before the Second World War, Lipscani was the place to do business in the city between the Middle Ages and the 1800s.\n\nSome of the street names still recall the guilds that were once based along them: Blănari (Furriers’ Street) or Șelari (Saddlers’ Street). This small pocket was one of the only parts of Bucharest to be retrievable after the Second World War and has been reborn as a stylish pedestrian zone that has boutiques, restaurants and bars in restored buildings.\n\nLook for Pasajul Macca-Vilacrosse on the west side, a fork-shaped shopping passage from 1891 lit by yellow stained glass in its roof.\n\nRecommended tour: Bucharest Old Town 2.5-Hour Private Walking Tour\n\n5. Romanian Peasant Museum\nRomanian Peasant Museum, Bucharest\nSource: Radu Bercan / shutterstock\n\nRomanian Peasant Museum\n\nFirst opened in 1906, the history of this highly-regarded folk museum was interrupted in the 20th century by the Communist regime, but it reopened in 1990 no more than six weeks after Ceaușescu died.\n\nIn those intervening years it had been a museum to communism, and you can still view a small exhibition on collectivisation in the basement preserved for posterity.\n\nThe remainder is dedicated to the history and culture of the Romanian countryside, summing up 400 years and presenting a jaw-dropping diversity of costume, furniture, religious objects and ceramics.\n\nThere’s also an entire wooden house (The House in the House), brought here from Gorj County in the southwest of the country.\n\n6. Herăstrău Park\nHerăstrău Park\nSource: Danilovski / shutterstock\n\nHerăstrău Park\n\nThe largest park in Bucharest borders the city to the north, and much of its area is taken up by the 74-hectare Herăstrău Lake.\n\nOn the Colentina River, this large body of water is partly man-made having been formed when riverside marshes were drained in the 1930s.\n\nThe lake has a six-kilometre perimeter path favoured by joggers in summer, and in this season you can rent a bike near the main entrance or take a boat trip from the jetty on the south shore.\n\nOn foot take a detour through the Insula Trandafirilor (Rose Island), down the lime tree avenues and into the Japanese Garden, planted with cherry trees that bloom in early spring.\n\n7. Stavropoleos Church\nStavropoleos Church, Bucharest\nSource: Marco Taliani de Marchio / shutterstock\n\nStavropoleos Church\n\nArguably the finest religious building in Bucharest, Stavropoleos Church has a gorgeous facade that has multifoil arches painted with arabesque foliate and tendril patterns and held up by beautiful capitals.\n\nAbove are painted medallions of saints, and there’s much more painting inside in the form of stone frescoes and a breathtaking iconostasis.\n\nThe church dates to the 1720s and its architecture is a perfect expression of Romania’s Brâncovenesc style, which blended Byzantine, Ottoman, Renaissance and Baroque elements.\n\nRight next door is an early 20th century building housing religious art like icons and frescoes from the many churches that were pulled down during the communist regime after the Second World War.\n\n8. National Museum of Art of Romania\nNational Museum of Art of Romania\nSource: Anton_Ivanov / shutterstock\n\nNational Museum Of Art Of Romania\n\nAfter King Michael I abdicated following the Second World War, the Neoclassical Royal Palace on Revolution Square has been the headquarters of Romania’s National Museum of Art.\n\nThe collections were damaged during the revolution in 1989, but there’s still a feast for art lovers in galleries for European Art, Romanian Medieval Art and Modern Romanian Art.\n\nThe European section has many big names like Lucas Cranach the Elder, Jan van Eyck, El Greco, Tintoretto, Peter Paul Rubens, Monet and Sisley.\n\nAlso be sure to get acquainted with some Romanian artists like the Post-Impressionists Nicolae Tonitza and Ștefan Luchian, and the surrealist Victor Brauner.\n\n9. Dealul Mitropoliei\nDealul Mitropoliei\nSource: ncristian / shutterstock\n\nDealul Mitropoliei\n\nSouth of Union Square is a small rise where Romania’s Orthodox religious institutions can be found in eye-catching buildings.\n\nThe Romanian Patriarchal Cathedral is one, and we’ll cover that next.\n\nBut this stands in an ensemble with the Palace of the Patriarchate, with its striking Ionic columns.\n\nFor 90 years from its completion in 1907 the palace was the seat of successive Romanian parliaments, from the Assembly of Deputies during the monarchy, through the Communist Great National Assembly to the Chamber of Deputies after the 1989 Revolution.\n\nThe hill is a sight to behold at Palm Sunday and Easter (Pascha), when it is packed with worshippers, a tradition that even continued under communist regime.\n\n10. Romanian Patriarchal Cathedral\nRomanian Patriarchal Cathedral, Bucharest\nSource: MAVRITSINA IRINA / shutterstock\n\nRomanian Patriarchal Cathedral\n\nThe destination for a pilgrimage on Palm Sunday, the Patriarchal Cathedral was founded by the Prince of Wallachia, Constantin Șerban in the 1650s.\n\nThe building has come through restorations in the 18th, 19th and 20th centuries, so not much of the original remains, while the current design is based on Curtea de Argeș Cathedral in the centre of the country.\n\nThe church also holds the relics of the 13th-century Saint Dimitrie Basarabov, the patron saint of Bucharest.\n\nHis remains were brought here from Bulgaria in 1774 and are kept in a silver reliquary with a glass panel on top.\n\n11. Revolution Square\nRevolution Square, Bucharest\nSource: Ungvari Attila / shutterstock\n\nRevolution Square\n\nThe setting for all sorts of Romanian institutions, Revolution Square got its name from the violent unrest in 1989 that deposed Nicolae Ceaușescu and overthrew the Socialist Republic of Romania.\n\nAn interesting building to ponder for a moment is the Ministry of Internal Affairs.\n\nThis was built as the Central Committee of the Romanian Communist Party, and in 1989 Ceaușescu and his wife Elena fled by helicopter from the roof before eventually being tried and executed on Christmas day of that year.\n\nAnother landmark event took place here twenty years earlier when Ceaușescu announced Romania’s policy of independence from the Kremlin after condemning the Soviet invasion of Czechoslovakia.\n\nThat speech marked the height of his popularity.\n\n12. Palatul Primăverii (Spring Palace)\nPalatul Primăverii, Bucharest\nSource: Idobi / Wikimedia\n\nSpring Palace\n\nNot far from the Herăstrău Park in the plush Primăverii neighbourhood is a compelling slice of 20th-century Romanian history.\n\nWith tours available by booking a day in advance, the Palatul Primăverii was the gaudy residence for the notorious dictator Nicolae Ceaușescu.\n\nThis 80-room palace was built in the 1960s, and came with a winter garden, wine cellar, silk wallpaper, valuable art, expensive furniture, a large swimming pool, bathrooms with solid gold fittings and even a cinema.\n\nAmong the world leaders received here was Richard Nixon, who had tea with Ceaușescu at the palace in 1969.\n\n13. Grigore Antipa Museum of Natural History\nGrigore Antipa Museum of Natural History\nSource: Radu Bercan / shutterstock\n\nGrigore Antipa Museum Of Natural History\n\nNamed after the man who was in charge for more than 50 years at the start of the 20th century, this natural history museum was given a big update a few years back and reopened in 2011. Multimedia and interactive exhibits now go hand-in-hand with the classic dinosaur skeletons, taxidermies and dioramas, many of which were first set up by Antipa decades ago.\n\nIn the basement there’s a comprehensive exhibition on the biodiversity of Romania, while the ground floor deals with all the major ecosystems on the earth’s surface.\n\nFrom there you can head off and indulge your curiosity in fields like mineralogy, entomology, marine biology and anthropology.\n\n14. Cismigiu Gardens\nCismigiu Gardens, Bucharest\nSource: Radu Bercan / shutterstock\n\nCismigiu Gardens\n\nThe oldest recreation space in the centre of Bucharest, Cismigiu Gardens took shape in the middle of the 19th century and were laid out by German landscape architect Carl Meyer.\n\nOn what used to be a lakeside vineyard, he planted thousands of tree and plant species sourced from Vienna’s botanical gardens and Romania’s upland regions.\n\nThe lake itself can be navigated by rowboat in the summer, and if it freezes over in winter it’s possible to go skating on its surface.\n\nThe Rondul Român is a memorial garden, with busts of Romania’s 12 best-loved writers, while there are also separate monuments to the French soldiers who died in Romania in First World War, and Americans who died in the country in the Second World War.",
      "coordinates": {
        "lat": 44.4369684,
        "lng": 26.0822504,
        "marker": "Cismigiu Gardens"
      }
    },
    {
      "id": 3,
      "name": "Cotroceni Palace",
      "banner": "banner_cotroceni_palace",
      "image": "image_cotroceni_palace",
      "details": "Raised in 1895 for Romania’s first king, Carol I, Cotroceni Palace is on a hill that had long been a place of residence for Romania’s rulers.\n\nFollowing the abdication of the last king, Michael I in 1947, the property was used to receive visiting heads of state.\n\nAnd since the return of democracy the palace has become the official residence of the President of Romania.\n\nThe oldest wing of the building is open to the public as the National Cotroceni Museum, showing off the splendour of the library, apartments and reception rooms, together with a mammoth collection of painting, sculpture, ceramics, graphic arts, furniture, textiles and glassware.\n\nMany of these items were the personal collections of Queen Marie of Romania and King Ferdinand I at the turn of the 20th century.",
      "coordinates": {
        "lat": 44.4345083,
        "lng": 26.051935,
        "marker": "Cotroceni Palace"
      }
    },
    {
      "id": 4,
      "name": "Dimitrie Gusti National Village Museum",
      "banner": "banner_dimitrie_gusti",
      "image": "image_dimitrie_gusti",
      "details": "The whole west side of the Herăstrău Park is given over to a massive outdoor museum, which has more than 270 authentic historic buildings.\n\nMade from stone, wood or cob (clay and straw), these have been carefully dismantled and put back together at this site and come from all corners of the country, from Banat in the West to Moldova in the east and Transylvania in the centre.\n\nEach region has its own style, whether it’s the brightly painted walls from the Danube Delta to the ornately carved portals from Berbeşti in the centre of Romania.\n\nThe museum was established by the eminent sociologist Dimitrie Gusti in 1936 and its oldest houses date from the 18th century.\n\nEach house also has a recorded explanation of its style and region, available in English.",
      "coordinates": {
        "lat": 44.4723586,
        "lng": 26.0743965,
        "marker": "Dimitrie Gusti National Village Museum"
      }
    },
    {
      "id": 5,
      "name": "George Enescu National Museum",
      "banner": "banner_george_enescu",
      "image": "image_george_enescu",
      "details": "One of the loveliest properties in Bucharest is the Beax-Arts/Art Nouveau palace conceived for the Prime Minister Gheorghe Grigore Cantacuzino in the early 1900s.\n\nFrom the street the elements you’ll notice is the exaggerated iron and glass entrance canopy and the dormers in the mansard roof.\n\nThe building has an oblique connection to Romania’s celebrated composer George Enescu, as Gheorghe Grigore Cantacuzino’s son was initially married to Enescu’s future wife, who then remarried the composer after he passed away.\n\nSince 1956 there has been a small museum devoted to Enescu in a few rooms in the palace, with personal possessions, instruments, posters and photographs.\n\n",
      "coordinates": {
        "lat": 4487684,
        "lng": 26.0797095,
        "marker": "George Enescu National Museum"
      }
    },
    {
      "id": 6,
      "name": "Grigore Antipa Museum of Natural History",
      "banner": "banner_grigore_antipa",
      "image": "image_grigore_antipa",
      "details": "Named after the man who was in charge for more than 50 years at the start of the 20th century, this natural history museum was given a big update a few years back and reopened in 2011. Multimedia and interactive exhibits now go hand-in-hand with the classic dinosaur skeletons, taxidermies and dioramas, many of which were first set up by Antipa decades ago.\n\nIn the basement there’s a comprehensive exhibition on the biodiversity of Romania, while the ground floor deals with all the major ecosystems on the earth’s surface.\n\nFrom there you can head off and indulge your curiosity in fields like mineralogy, entomology, marine biology and anthropology.",
      "coordinates": {
        "lat": 44.4531128,
        "lng": 26.0759049,
        "marker": "Grigore Antipa Museum of Natural History"
      }
    },
    {
      "id": 7,
      "name": "Lipscani (Old Town)",
      "banner": "banner_lipscani",
      "image": "image_lipscani",
      "details": "A hint of what Bucharest looked like before the Second World War, Lipscani was the place to do business in the city between the Middle Ages and the 1800s.\n\nSome of the street names still recall the guilds that were once based along them: Blănari (Furriers’ Street) or Șelari (Saddlers’ Street). This small pocket was one of the only parts of Bucharest to be retrievable after the Second World War and has been reborn as a stylish pedestrian zone that has boutiques, restaurants and bars in restored buildings.\n\nLook for Pasajul Macca-Vilacrosse on the west side, a fork-shaped shopping passage from 1891 lit by yellow stained glass in its roof.",
      "coordinates": {
        "lat": 4.432499,
        "lng": 26.0856735,
        "marker": ""
      }
    },
    {
      "id": 8,
      "name": "Parliamentary Palace",
      "banner": "banner_parliamentary_palace",
      "image": "image_parliamentary_palace",
      "details": "A building of absurd magnitude, the Parliamentary Palace hosts Romania’s Parliament, but also perfectly encapsulates Nicolae Ceaușescu’s megalomania.\n\nAt 365,000 square metres, it’s the largest administrative building in the world, intended as a residence, and despite containing reception halls, museums and government offices and the parliament hall, is still almost three quarters empty.\n\nThe palace was raised at an enormous cost, in terms of money but also lives, as thousands of people are claimed to have died during its construction in the second half of the 1980s.\n\nThe palace was the focal point of Ceaușescu’s pompous redesign of Bucharest following an earthquake in 1977, and had eight subterranean levels, at the bottom of which was a nuclear bunker.\n\nYou have to go in to gauge the full, stupefying size of this building, paying a visit to the Museum of the Palace, Museum of Communist Totalitarianism and the National Museum of Contemporary Art.",
      "coordinates": {
        "lat": 44.4320396,
        "lng": 26.0909993,
        "marker": "Lipscani (Old Town)"
      }
    },
    {
      "id": 9,
      "name": "Romanian Peasant Museum",
      "banner": "banner_peasant_museum",
      "image": "image_peasant_museum",
      "details": "First opened in 1906, the history of this highly-regarded folk museum was interrupted in the 20th century by the Communist regime, but it reopened in 1990 no more than six weeks after Ceaușescu died.\n\nIn those intervening years it had been a museum to communism, and you can still view a small exhibition on collectivisation in the basement preserved for posterity.\n\nThe remainder is dedicated to the history and culture of the Romanian countryside, summing up 400 years and presenting a jaw-dropping diversity of costume, furniture, religious objects and ceramics.\n\nThere’s also an entire wooden house (The House in the House), brought here from Gorj County in the southwest of the country.",
      "coordinates": {
        "lat": 44.4544195,
        "lng": 26.0748669,
        "marker": "Romanian Peasant Museum"
      }
    }
  ]
}